ФинансовыйДневник/src/Documents/Покупка/Покупка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Покупка</name>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.ЛичныеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасхода</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделитьПоТоварам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ФинансовыйДневник/src/Documents/Покупка/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлемента(Объект, Элементы);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РазделитьПоТоварамПриИзменении(Элемент)
	УстановитьВидимостьЭлемента(Объект, Элементы);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыУслуги
&НаКлиенте
Процедура ТоварыУслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СуммаПоСтроке(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СуммаПоСтроке(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиПриИзменении(Элемент)
	Если Объект.РазделитьПоТоварам Тогда
		Объект.Сумма = Объект.ТоварыУслуги.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиСуммаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	
	Если СтрокаТЧ.Количество = 0 Тогда
		СтрокаТЧ.Количество = 1;
	КонецЕсли;
	
	СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура СуммаПоСтроке(СтрокаТЧ)
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлемента(Объект, Элементы)
	
	Если Объект.РазделитьПоТоварам = Истина Тогда
		Элементы.ТоварыУслуги.Видимость = Истина;
	Иначе
		Элементы.ТоварыУслуги.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
